import os
import django
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "news_web.settings")
django.setup()
from main.models import Image,news,InvertedIndex,Category
import matplotlib.pyplot as plt  
from wordcloud import WordCloud,STOPWORDS,ImageColorGenerator
from django.shortcuts import get_object_or_404
f="" 
tp=get_object_or_404(Category,pk=8)
news_tp=tp.news_set.all()
for new in news_tp:
    f+=f"{new.title}{new.text}"
stop=set(["其中","此外","和","而且","不过","同时","目前","因此","另外","包括不限于超链接二维码","声明 本文仅代表作者观点","比如","众所周知","近日","事实上","责任编辑","本文结束 如需转载请务必注明出处","实际上","月 日消息","首先","现在","可以说","如需转载请务必注明出处 快科技","广告声明 本文含有的对外跳转链接","也就是说","并且","最后","显示","近期","此后","未来","彼时","其实","另一方面","据悉","确实","石秀珍","刘万里","本文仅代表作者观点","口令形式","其次","表示","最终","例如","快科技","最近","图","王慧文","图源","也就是说","事实上","节省甄选时间 结果仅供参考","韦子荣","等","如今","此前","只是","显然","截至目前","值得注意的是","现在","可以说","据","左右","换句话说","财报显示","近年来","上","值得一提的是","公开资料显示","显示","他说","支持","年","的股份","那么","报告期内","今天","随后","于是","据介绍","你","但","在他看来","声明","韦子荣","不代表新浪网立场","月","日","消息","但是","与此同时","结语","本文结束","如需转载请务必注明出处","不代表新浪网立场","当然","不仅如此","今年","广告声明","数据显示","可以看到","由此可见","包括","今日","一直以来","一方面","当前","根据","这意味着","二维码","口令等形式","系列","三","中","所以","以","之后","他表示","今年以来","亿元","2亿元","3亿元","4亿元","6亿元","7亿元","36氪","IT之家备注","当前约","以及","5亿元","A","版权所有","未经许可不得转载","in","据了解","的","与","日消息","以下简称","韦","子","蓉","韦子蓉","SF014","在","除此之外","然而","对此","化名","2022年","节省甄选时间 结果仅供参考","然而","1亿元","这也意味着","在此之前","这也意味着","认为","亿元人民币","亿元","记者","王者荣耀","B","本文来自于","本文来自于手机中国","具体来看","图片来源","新浪科技讯","2022年12月","称","或","N","作者","美元","年","手机","到","The","节省甄选时间 结果仅供参考","用于传递更多信息","节省甄选时间","结果仅供参考","了解到","尽管如此","要知道","蔚小理","来源","IT之家","说","虽然","今日财经新闻","文内含有的对外跳转链接","包括不限于超链接","目前","时","据媒体报道","相比之下","换言之","是","IT之家注","同样","毕竟","个","后来","人","这一年","需要注意的是","今年一季度","过去一年","当时","万元","5万元","第一","总的来说","整体来看","尽管如此","当时","目前来看","据报道","IT之家所有文章均包含本声明","第二","报道称","更重要的是","IT之家了解到","资料显示","日前","因为","为此","作为对比","吨","上方文Q","了","第三","通过","招股书显示","作为对比","具体来说","产品","在此背景下","文猛","郑卓","以上","iphone","Pro","发布","S","RTX","售价","到手价","元","美媒","X","Pad","CPU","vivo","Ultra","OPPO","苹果","Apple","原祎鸣","SF183","而","他认为","狂飙","孙子兵法","LK","","","","","","","Z","","","","","","","","",])
wordcloud = WordCloud(  
        background_color = 'white',  
        font_path = 'C:\Windows\Fonts\STZHONGS.TTF',#设置显示中文  
        width = 1000,  
        height = 900,  
        margin = 2,
        stopwords=stop).generate(f) #对全部文本进行自动分词  
plt.imshow(wordcloud)  
plt.axis('off')  
plt.show()